jxz1223/DC_BLE_Lockin/STM32_WPAN/App/custom_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    custom_app.c
  * @author  MCD Application Team
  * @brief   Custom Example Application (Server)
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble.h"
#include "custom_app.h"
#include "custom_stm.h"
#include "stm32_seq.h"
#include "app_ble.h"
#include "multi_node_protocol.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  /* DT_SERVICE */
  uint8_t               Tx_char_Notification_Status;
  /* USER CODE BEGIN CUSTOM_APP_Context_t */
  uint8_t               SW1_Status;
  /* USER CODE END CUSTOM_APP_Context_t */

  uint16_t              ConnectionHandle;
} Custom_App_Context_t;

/* USER CODE BEGIN PTD */
extern ADC_HandleTypeDef hadc1;
extern TIM_HandleTypeDef htim2;

typedef struct
{
  uint8_t Active;
  uint8_t BeginSent;
  uint8_t AbortRequested;
  uint16_t ScanId;
  uint16_t Seq;
  uint16_t DacMin;
  uint16_t DacMax;
  uint16_t TotalPoints;
  uint16_t NextPoint;
  uint16_t CompletedPoints;
  uint16_t SettleMs;
  uint8_t AvgBlocks;
  uint16_t PreScanDac;
} Sensor_ScanContext_t;
/* USER CODE END PTD */

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define SCL_0()		HAL_GPIO_WritePin(SCL_GPIO_Port, SCL_Pin,GPIO_PIN_RESET)
#define SCL_1()		HAL_GPIO_WritePin(SCL_GPIO_Port, SCL_Pin,GPIO_PIN_SET)
#define SDA_0()		HAL_GPIO_WritePin(SDA_GPIO_Port, SDA_Pin,GPIO_PIN_RESET)
#define SDA_1()		HAL_GPIO_WritePin(SDA_GPIO_Port, SDA_Pin,GPIO_PIN_SET)

#define FSYNC_0()		HAL_GPIO_WritePin(FSYNC_GPIO_Port, FSYNC_Pin,GPIO_PIN_RESET)
#define FSYNC_1()		HAL_GPIO_WritePin(FSYNC_GPIO_Port, FSYNC_Pin,GPIO_PIN_SET)

#define SCK_0()		HAL_GPIO_WritePin(SCLK_GPIO_Port, SCLK_Pin,GPIO_PIN_RESET)
#define SCK_1()		HAL_GPIO_WritePin(SCLK_GPIO_Port, SCLK_Pin,GPIO_PIN_SET)

#define DAT_0()		HAL_GPIO_WritePin(SDATA_GPIO_Port, SDATA_Pin,GPIO_PIN_RESET)
#define DAT_1()		HAL_GPIO_WritePin(SDATA_GPIO_Port, SDATA_Pin,GPIO_PIN_SET)

#define TOGGLE_ON                       1
#define TOGGLE_OFF                      0
#define SENSOR_LEGACY_STREAM_ENABLED    0U

#define SENSOR_PROTOCOL_MAGIC_0         MULTI_PROTOCOL_MAGIC_0
#define SENSOR_PROTOCOL_MAGIC_1         MULTI_PROTOCOL_MAGIC_1
#define SENSOR_PROTOCOL_VERSION         MULTI_PROTOCOL_VERSION
#define SENSOR_PROTOCOL_HEADER_LEN      MULTI_PROTOCOL_HEADER_LEN
#define SENSOR_PROTOCOL_MAX_PAYLOAD     MULTI_PROTOCOL_MAX_PAYLOAD
#define SENSOR_PROTOCOL_MAX_FRAME       MULTI_PROTOCOL_MAX_FRAME

#define SENSOR_CMD_SCAN_START           MULTI_CMD_SCAN_START
#define SENSOR_CMD_SET_DAC              MULTI_CMD_SET_DAC
#define SENSOR_CMD_ABORT                MULTI_CMD_ABORT
#define SENSOR_CMD_STREAM_GRANT         MULTI_CMD_STREAM_GRANT
#define SENSOR_CMD_FRAME_ACK            MULTI_CMD_FRAME_ACK

#define SENSOR_EVT_ACK                  MULTI_EVT_ACK
#define SENSOR_EVT_NACK                 MULTI_EVT_NACK
#define SENSOR_EVT_SCAN_BEGIN           MULTI_EVT_SCAN_BEGIN
#define SENSOR_EVT_SCAN_POINTS          MULTI_EVT_SCAN_POINTS
#define SENSOR_EVT_SCAN_END             MULTI_EVT_SCAN_END
#define SENSOR_EVT_SENSOR_READINGS      MULTI_EVT_SENSOR_READINGS
#define SENSOR_EVT_BLE_RAW              MULTI_EVT_BLE_RAW

#define SENSOR_STATUS_OK                MULTI_STATUS_OK
#define SENSOR_STATUS_CRC_ERROR         MULTI_STATUS_CRC_ERROR
#define SENSOR_STATUS_BAD_VERSION       MULTI_STATUS_BAD_VERSION
#define SENSOR_STATUS_BAD_LENGTH        MULTI_STATUS_BAD_LENGTH
#define SENSOR_STATUS_UNKNOWN_TYPE      MULTI_STATUS_UNKNOWN_TYPE
#define SENSOR_STATUS_BUSY              MULTI_STATUS_BUSY
#define SENSOR_STATUS_QUEUE_FULL        MULTI_STATUS_QUEUE_FULL

#define SENSOR_SET_FLAG_SAVE_DAC        MULTI_SET_DAC_FLAG_SAVE
#define SENSOR_SCAN_POINTS_PER_FRAME    10U
#define SENSOR_SCAN_DEFAULT_SETTLE_MS   20U
#define SENSOR_SCAN_MAX_SETTLE_MS       80U
#define SENSOR_SCAN_MAX_AVG_BLOCKS      16U
#define SENSOR_LOCKIN_WAIT_TIMEOUT_MS   40U
#define SENSOR_READING_ITEMS_PER_FRAME  1U
#define SENSOR_READING_ITEM_SIZE        8U
#define SENSOR_TX_QUEUE_DEPTH           8U
#define SENSOR_TX_ACK_TIMEOUT_MS        180U
#define SENSOR_TX_MAX_RETRIES           3U
#define SENSOR_STREAM_CREDIT_LIMIT      8U

#define SENSOR_DAC_STORE_MAGIC          0xDAC05A5AU
#define SENSOR_APP_FLASH_SIZE           (512U * 1024U)
#define SENSOR_DAC_STORE_ADDRESS        (FLASH_BASE + SENSOR_APP_FLASH_SIZE - FLASH_PAGE_SIZE)
/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define ADC_CONVERTED_DATA_BUFFER_SIZE   ((uint8_t)  120)
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

static Custom_App_Context_t Custom_App_Context;

/**
 * END of Section BLE_APP_CONTEXT
 */

uint8_t UpdateCharData[512];
uint8_t NotifyCharData[512];
uint16_t Connection_Handle;
/* USER CODE BEGIN PV */
__IO   uint16_t   aADCxConvertedData[ADC_CONVERTED_DATA_BUFFER_SIZE]; /* ADC group regular conversion data (array of data) */
uint16_t   aADCxConvertedData_Voltage_mVolt[ADC_CONVERTED_DATA_BUFFER_SIZE];  /* Value of voltage calculated from ADC conversion data (unit: mV) (array of data) */
/*汇报DMA转换状�??*/
/* Variable to report status of DMA transfer of ADC group regular conversions */
/*  0: DMA transfer is not completed                                          */
/*  1: DMA transfer is completed                                              */
/*  2: DMA transfer has not yet been started yet (initial state)              */
__IO   uint8_t ubDmaTransferStatus = 2; /* Variable set into DMA interruption callback */
uint16_t kk;
uint16_t Att_Mtu_Exchanged;
__IO uint8_t buffer1 = 0;
uint8_t jk=0;
uint8_t jjk=0;
#define LOCKIN_REF_TABLE_SIZE                 8
#define LOCKIN_Q15_SCALE                      32768
#define LOCKIN_ADC_MIDPOINT                   2048
static const int16_t LockinSinQ15[LOCKIN_REF_TABLE_SIZE] = {0, 23170, 32767, 23170, 0, -23170, -32767, -23170};
static const int16_t LockinCosQ15[LOCKIN_REF_TABLE_SIZE] = {32767, 23170, 0, -23170, -32767, -23170, 0, 23170};
uint32_t lockin_sample_index = 0;
__IO uint16_t lockin_rms_value = 0;
static Sensor_ScanContext_t SensorScan;
typedef struct
{
  uint8_t Length;
  uint8_t Type;
  uint8_t Reliable;
  uint8_t Sent;
  uint8_t Retries;
  uint16_t ScanId;
  uint16_t Seq;
  uint32_t LastSendTick;
  uint8_t Data[SENSOR_PROTOCOL_MAX_FRAME];
} Sensor_TxSlot_t;

