jxz1223/DC_BLE_Lockin/STM32_WPAN/App/custom_app.c
static uint16_t SensorCurrentDac = 0U;
static uint8_t SensorNotifyReady = 0U;
static Sensor_TxSlot_t SensorTxQueue[SENSOR_TX_QUEUE_DEPTH];
static uint8_t SensorTxHead;
static uint8_t SensorTxTail;
static uint8_t SensorTxCount;
static uint8_t SensorStreamCredits;
static uint16_t SensorTransportSeq = 1U;
static uint16_t SensorReadingSeq = 0U;
static uint8_t SensorLastCommandValid;
static uint8_t SensorLastCommandType;
static uint16_t SensorLastCommandScanId;
static uint16_t SensorLastCommandSeq;
static uint8_t SensorLastCommandStatus;
static uint8_t SensorLastCommandWasAck;
static __IO uint16_t SensorLatestAdcSample = 0U;
static __IO uint32_t SensorLockinSeq = 0U;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* DT_SERVICE */
static void Custom_Tx_char_Update_Char(void);
static void Custom_Tx_char_Send_Notification(void);

/* USER CODE BEGIN PFP */
void DDS_START(double Freq);
void DAC_START(void);
void DAC_CHANGE(unsigned int AM);
void ADC_START(void);
void MM1205(void);
static void SendData(void);
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc);
static uint16_t Lockin_CalcRms(const uint16_t *pSamples, uint16_t length);
static int32_t Lockin_GetCenteredSample(uint16_t adc_sample);
static void Lockin_FillRmsFrame(uint16_t rms_value);
static uint64_t IntSqrt64(uint64_t value);
static void Sensor_Command_Received(const uint8_t *pPayload, uint8_t length);
static void Sensor_Scan_Task(void);
static uint8_t Sensor_ParseFrame(const uint8_t *data, uint8_t length);
static uint8_t Sensor_HandleCommand(uint8_t type, uint8_t flags, uint16_t scan_id, uint16_t seq, const uint8_t *payload, uint8_t payload_len);
static tBleStatus Sensor_SendFrame(uint8_t type, uint8_t flags, uint16_t scan_id, uint16_t seq, const uint8_t *payload, uint8_t payload_len);
static void Sensor_SendDiag(const char *text);
static void Sensor_SendAck(uint8_t type, uint16_t scan_id, uint16_t seq, uint8_t status);
static void Sensor_SendNack(uint8_t type, uint16_t scan_id, uint16_t seq, uint8_t status);
static tBleStatus Sensor_SendReadingFrame(void);
static void Sensor_TxPump(void);
static void Sensor_TxPop(void);
static void Sensor_PrioritizeBusinessCommand(void);
static void Sensor_TxReset(void);
static void Sensor_HandleFrameAck(uint16_t scan_id, uint16_t seq,
                                  const uint8_t *payload, uint8_t payload_len);
static void Sensor_RecordCommandResult(uint8_t type, uint16_t scan_id,
                                       uint16_t seq, uint8_t status,
                                       uint8_t was_ack);
static uint8_t Sensor_IsDuplicateCommand(uint8_t type, uint16_t scan_id,
                                         uint16_t seq);
static void Sensor_RefreshQueuedFrameCrc(Sensor_TxSlot_t *pSlot);
static uint8_t Sensor_HasQueuedReading(void);
static uint16_t Sensor_Crc16Ccitt(const uint8_t *data, uint16_t length);
static uint16_t Sensor_ReadLe16(const uint8_t *payload);
static void Sensor_WriteLe16(uint8_t *payload, uint16_t value);
static uint16_t Sensor_InterpolateDac(uint16_t index);
static uint16_t Sensor_ReadLockinAverage(uint8_t avg_blocks);
static uint16_t Sensor_WaitNextLockinValue(uint32_t *pLastSeq);
static void Sensor_DacApply(uint16_t dac_code);
static uint16_t Sensor_DacLoadSaved(uint16_t fallback);
static uint8_t Sensor_DacSave(uint16_t dac_code);
static uint8_t Sensor_IsBusinessCommand(uint8_t type);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void Custom_STM_App_Notification(Custom_STM_App_Notification_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_STM_App_Notification_1 */
    
  /* USER CODE END CUSTOM_STM_App_Notification_1 */
  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

    /* USER CODE END CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

    /* DT_SERVICE */
    case CUSTOM_STM_TX_CHAR_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_TX_CHAR_NOTIFY_ENABLED_EVT */
      Custom_App_Context.Tx_char_Notification_Status = 1;
      SensorNotifyReady = 1U;
      Sensor_SendDiag("SENSOR_NOTIFY_ENABLED");
    	UTIL_SEQ_SetTask(1 << CFG_TASK_DATA_TRANSFER_UPDATE_ID, CFG_SCH_PRIO_0);
      /* USER CODE END CUSTOM_STM_TX_CHAR_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_TX_CHAR_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_TX_CHAR_NOTIFY_DISABLED_EVT */
      Custom_App_Context.Tx_char_Notification_Status = 0;
      SensorNotifyReady = 0U;
      /* USER CODE END CUSTOM_STM_TX_CHAR_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_RX_CHAR_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_RX_CHAR_WRITE_EVT */
      BSP_LED_Toggle(LED_BLUE);
      Sensor_Command_Received(pNotification->DataTransfered.pPayload,
                              pNotification->DataTransfered.Length);
      /* USER CODE END CUSTOM_STM_RX_CHAR_WRITE_EVT */
      break;

    case CUSTOM_STM_NOTIFICATION_COMPLETE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_NOTIFICATION_COMPLETE_EVT */
      /* Queue ownership is based on API acceptance/application ACK, not this optional event. */
      UTIL_SEQ_SetTask(1 << CFG_TASK_DATA_TRANSFER_UPDATE_ID, CFG_SCH_PRIO_0);
      if (SensorScan.Active != 0U)
      {
        UTIL_SEQ_SetTask(1U << CFG_TASK_DAC_SCAN_ID, CFG_SCH_PRIO_0);
      }
      /* USER CODE END CUSTOM_STM_NOTIFICATION_COMPLETE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_STM_App_Notification_default */
    	BSP_LED_On(LED_RED);
      /* USER CODE END CUSTOM_STM_App_Notification_default */
      break;
  }
  /* USER CODE BEGIN CUSTOM_STM_App_Notification_2 */

  /* USER CODE END CUSTOM_STM_App_Notification_2 */
  return;
}

void Custom_APP_Notification(Custom_App_ConnHandle_Not_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_APP_Notification_1 */

  /* USER CODE END CUSTOM_APP_Notification_1 */

  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_APP_Notification_Custom_Evt_Opcode */

    /* USER CODE END P2PS_CUSTOM_Notification_Custom_Evt_Opcode */
    case CUSTOM_CONN_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_CONN_HANDLE_EVT */
      Connection_Handle = pNotification->ConnectionHandle;
      BSP_LED_On(LED_BLUE);
      BSP_LED_Off(LED_RED);
      /* USER CODE END CUSTOM_CONN_HANDLE_EVT */
      break;

    case CUSTOM_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_DISCON_HANDLE_EVT */
      SensorNotifyReady = 0U;
      Custom_App_Context.Tx_char_Notification_Status = 0U;
      SensorStreamCredits = 0U;
      SensorScan.Active = 0U;
      Sensor_TxReset();
      Connection_Handle = 0U;
      BSP_LED_Off(LED_BLUE);
      BSP_LED_On(LED_RED);
      /* USER CODE END CUSTOM_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_APP_Notification_default */

      /* USER CODE END CUSTOM_APP_Notification_default */
      break;
  }

  /* USER CODE BEGIN CUSTOM_APP_Notification_2 */

  /* USER CODE END CUSTOM_APP_Notification_2 */

  return;
}

void Custom_APP_Init(void)
{
  /* USER CODE BEGIN CUSTOM_APP_Init */
	DAC_START();
	SensorCurrentDac = Sensor_DacLoadSaved(0x0000U);
	Sensor_DacApply(SensorCurrentDac);//MAX is 0xFFFF
	DDS_START(1000);
	MM1205();
	ADC_START();
	UTIL_SEQ_RegTask( 1<<CFG_TASK_DATA_TRANSFER_UPDATE_ID, UTIL_SEQ_RFU, SendData);
	UTIL_SEQ_RegTask(1U << CFG_TASK_DAC_SCAN_ID, UTIL_SEQ_RFU, Sensor_Scan_Task);
	Custom_App_Context.Tx_char_Notification_Status = 0;
  SensorNotifyReady = 0U;
  Sensor_TxReset();
  /* USER CODE END CUSTOM_APP_Init */
  return;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

