jxz1223/DC_BLE_Lockin/STM32_WPAN/App/custom_app.c
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/* DT_SERVICE */
__USED void Custom_Tx_char_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Tx_char_UC_1*/

  /* USER CODE END Tx_char_UC_1*/

  if (updateflag != 0)
  {
	Custom_STM_App_Update_Char_Ext(Connection_Handle, CUSTOM_STM_TX_CHAR, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Tx_char_UC_Last*/

  /* USER CODE END Tx_char_UC_Last*/
  return;
}

__USED void Custom_Tx_char_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Tx_char_NS_1*/
  updateflag=Custom_App_Context.Tx_char_Notification_Status;
  /* USER CODE END Tx_char_NS_1*/

  if (updateflag != 0)
  {
	Custom_STM_App_Update_Char_Ext(Connection_Handle, CUSTOM_STM_TX_CHAR, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Tx_char_NS_Last*/

  /* USER CODE END Tx_char_NS_Last*/

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/
void SW1_Button_Action(void)
{
  UTIL_SEQ_SetTask( 1<<CFG_TASK_SW1_BUTTON_PUSHED_ID, CFG_SCH_PRIO_0);

  return;
}

void Resume_Notification(void)
{
	Custom_App_Context.Tx_char_Notification_Status = 1;
	UTIL_SEQ_SetTask(1 << CFG_TASK_DATA_TRANSFER_UPDATE_ID, CFG_SCH_PRIO_0);
	return;
}

void DAC_WRITE(unsigned int TxData)
{
	unsigned char i;
	SCL_0();HAL_Delay(1);
	for(i = 0; i < 8; i++)
	{
		if(TxData & 0x80)
			SDA_1();
		else
			SDA_0();
		HAL_Delay(1);
		SCL_1();
		HAL_Delay(1);
		SCL_0();
		TxData <<= 1;
	}
	SDA_0();HAL_Delay(1);SCL_1();HAL_Delay(1);SCL_0();
}

void DAC_START(void)
{
	SDA_1();SCL_1();
	HAL_Delay(1);
	/*Write Address*/
	SDA_0();HAL_Delay(1);
	DAC_WRITE(0x98);
	DAC_WRITE(0x40);
	DAC_WRITE(0x00);
	DAC_WRITE(0x00);
	HAL_Delay(1);SCL_1();HAL_Delay(1);SDA_1();
}

void DAC_CHANGE(unsigned int AM)
{
	SDA_0();HAL_Delay(1);
	DAC_WRITE(0x98);
	DAC_WRITE(0x30);
	DAC_WRITE(AM>>8);
	DAC_WRITE(AM);
	HAL_Delay(1);SCL_1();HAL_Delay(1);SDA_1();
}

void AD9833_Write(unsigned int TxData)
{
	unsigned char i;

	SCK_1();
	HAL_Delay(1);
	FSYNC_1();
	HAL_Delay(1);
	FSYNC_0();
	HAL_Delay(1);
	for(i = 0; i < 16; i++)
	{
		if (TxData & 0x8000)
			DAT_1();
		else
			DAT_0();

		HAL_Delay(1);
		SCK_0();
		HAL_Delay(1);
		SCK_1();

		TxData <<= 1;
	}
	FSYNC_1();

}

void DDS_START(double Freq)
{
	int frequence_LSB,frequence_MSB,Phs_data;
	double   frequence_mid,frequence_DATA;
	long int frequence_hex;
	FSYNC_0();SCK_0();DAT_0();
	frequence_mid=268435456/8;//适合25M晶振
	frequence_DATA=Freq;
	frequence_DATA=frequence_DATA/1000000;
	frequence_DATA=frequence_DATA*frequence_mid;
	frequence_hex=frequence_DATA;  //这个frequence_hex的�?�是32位的�????个很大的数字，需要拆分成两个14位进行处理；
	frequence_LSB=frequence_hex; //frequence_hex�????16位�?�给frequence_LSB
	frequence_LSB=frequence_LSB&0x3fff;//去除�????高两位，16位数换去掉高位后变成�????14�????
	frequence_MSB=frequence_hex>>14; //frequence_hex�????16位�?�给frequence_HSB
	frequence_MSB=frequence_MSB&0x3fff;//去除�????高两位，16位数换去掉高位后变成�????14�????

	Phs_data=0|0xC000;	//相位�????
	AD9833_Write(0x0100); //复位AD9833,即RESET位为1
	AD9833_Write(0x2100); //选择数据�????次写入，B28位和RESET位为1

	frequence_LSB=frequence_LSB|0x4000;
	frequence_MSB=frequence_MSB|0x4000;
	 //使用频率寄存�????0输出波形
	AD9833_Write(frequence_LSB); //L14，�?�择频率寄存�????0的低14位数据输�????
	AD9833_Write(frequence_MSB); //H14 频率寄存器的�????14位数据输�????
	AD9833_Write(Phs_data);	//设置相位
	AD9833_Write(0x2000);//输出正弦�????
}

void MM1205(void)
{
	//90V on
	HAL_Delay(100);
	//ON and Off
	//while(1)
	{
		HAL_GPIO_WritePin(GPIOB, M1_Pin, GPIO_PIN_RESET);
		HAL_Delay(100);
		HAL_GPIO_WritePin(GPIOB, M1_Pin, GPIO_PIN_SET);
		HAL_Delay(100);
		HAL_GPIO_WritePin(GPIOB, M1_Pin, GPIO_PIN_RESET);
		HAL_Delay(100);
		HAL_GPIO_WritePin(GPIOB, M1_Pin, GPIO_PIN_SET);
		HAL_Delay(100);
		HAL_GPIO_WritePin(GPIOB, M1_Pin, GPIO_PIN_RESET);
		HAL_Delay(100);
		HAL_GPIO_WritePin(GPIOB, M1_Pin, GPIO_PIN_SET);
		HAL_Delay(100);
		HAL_GPIO_WritePin(GPIOB, M1_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOB, ME_Pin, GPIO_PIN_SET);
		//HAL_Delay(1000);
		//HAL_GPIO_WritePin(GPIOB, ME_Pin, GPIO_PIN_RESET);
		//HAL_Delay(1000);
	}


	//HAL_Delay(10000);
}


void ADC_START(void)
{
	uint8_t i;
	  for (i=0 ; i<(ADC_CONVERTED_DATA_BUFFER_SIZE*2) ; i++)
	  {
		  NotifyCharData[i] = 2;
	  }
	  NotifyCharData[0] = (uint8_t)(0x8F);
	  NotifyCharData[1] = (uint8_t)(0x8E);
	  NotifyCharData[2] = (uint8_t)(0x8F);
	  NotifyCharData[243] = (uint8_t)(0x8E);
	  NotifyCharData[244] = (uint8_t)(0x8F);
	  NotifyCharData[245] = (uint8_t)(0x8E);
	  for (i=0 ; i<(SizeTx_Char) ; i++)
	  	  {
		  UpdateCharData[i] = i;
	  	  }

		uint32_t tmp_index_adc_converted_data = 0;
		for (tmp_index_adc_converted_data = 0; tmp_index_adc_converted_data < ADC_CONVERTED_DATA_BUFFER_SIZE; tmp_index_adc_converted_data++)
	  {
	    aADCxConvertedData[tmp_index_adc_converted_data] = VAR_CONVERTED_DATA_INIT_VALUE;
	  }
	  if (HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED) != HAL_OK)
	  {
	    /* Calibration Error */
	    Error_Handler();
	  }
		if (HAL_TIM_Base_Start(&htim2) != HAL_OK)
	  {
	    /* Counter enable error */
	    Error_Handler();
	  }
	  /*## Start ADC conversions ###############################################*/
	  /* Start ADC group regular conversion with DMA */
	  if (HAL_ADC_Start_DMA(&hadc1,
	                        (uint32_t *)aADCxConvertedData,
	                        ADC_CONVERTED_DATA_BUFFER_SIZE
	                       ) != HAL_OK)
	  {
	    /* ADC conversion start error */
	    Error_Handler();
		}
	return;
}




void SendData( void )
{
  Sensor_TxPump();

  if ((SensorNotifyReady != 0U) &&
      (Custom_App_Context.Tx_char_Notification_Status == 1U) &&
      (buffer1 == 1U) &&
      (SensorScan.Active == 0U) &&
      (SensorStreamCredits > 0U) &&
      (Sensor_HasQueuedReading() == 0U))
  {
    tBleStatus status;

    kk=kk+1;
    if (kk==20)
    {
      BSP_LED_On(LED_BLUE);
    }
    if (kk==40)
    {
      BSP_LED_Off(LED_BLUE);
      kk=0;
    }

    status = Sensor_SendReadingFrame();
    if (status == BLE_STATUS_SUCCESS)
    {
      buffer1 = 0U;
      SensorStreamCredits--;
      Sensor_TxPump();
    }
  }
  return;
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
	/*单定时器结束*/

  /* Computation of ADC conversions raw data to physical values               */
  /* using LL ADC driver helper macro.                                        */
  /* Management of the 2nd half of the buffer */

