jxz1223/DC_BLE_Lockin/STM32_WPAN/App/custom_app.c
	//for (tmp_index = (ADC_CONVERTED_DATA_BUFFER_SIZE/2); tmp_index < ADC_CONVERTED_DATA_BUFFER_SIZE; tmp_index++)
  //{
    //aADCxConvertedData_Voltage_mVolt[tmp_index] = __ADC_CALC_DATA_VOLTAGE(VDDA_APPLI, aADCxConvertedData[tmp_index]);
  //}
	  /* Update status variable of DMA transfer */
  ubDmaTransferStatus = 1;
  lockin_rms_value = Lockin_CalcRms((const uint16_t *)aADCxConvertedData, ADC_CONVERTED_DATA_BUFFER_SIZE);
  SensorLatestAdcSample = aADCxConvertedData[ADC_CONVERTED_DATA_BUFFER_SIZE - 1U];
  SensorLockinSeq++;
  Lockin_FillRmsFrame(lockin_rms_value);
  buffer1 = 1U;
  UTIL_SEQ_SetTask(1 << CFG_TASK_DATA_TRANSFER_UPDATE_ID, CFG_SCH_PRIO_0);
}

void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef *hadc)
{
  /* Update status variable of DMA transfer */
	//Error_Handler();
  ubDmaTransferStatus = 0;
}

static uint16_t Lockin_CalcRms(const uint16_t *pSamples, uint16_t length)
{
  int64_t sum_sin_q15 = 0;
  int64_t sum_cos_q15 = 0;
  uint16_t i;

  if (length == 0U)
  {
    return 0;
  }

  for (i = 0U; i < length; i++)
  {
    uint8_t ref_index = (uint8_t)((lockin_sample_index + i) & (LOCKIN_REF_TABLE_SIZE - 1U));
    int32_t sample = Lockin_GetCenteredSample(pSamples[i]);

    sum_sin_q15 += (int64_t)sample * LockinSinQ15[ref_index];
    sum_cos_q15 += (int64_t)sample * LockinCosQ15[ref_index];
  }

  lockin_sample_index = (lockin_sample_index + length) & (LOCKIN_REF_TABLE_SIZE - 1U);

  /*
   * For x=A*sin(wt+phi), the lock-in DC terms are A/2 on I/Q.
   * RMS = A/sqrt(2) = sqrt(2 * (I^2 + Q^2)).
   */
  int64_t mean_sin_q15 = sum_sin_q15 / length;
  int64_t mean_cos_q15 = sum_cos_q15 / length;
  uint64_t power_q30 = 2ULL * ((uint64_t)(mean_sin_q15 * mean_sin_q15) +
                               (uint64_t)(mean_cos_q15 * mean_cos_q15));
  uint32_t rms = (uint32_t)((IntSqrt64(power_q30) + (LOCKIN_Q15_SCALE / 2U)) /
                            LOCKIN_Q15_SCALE);

  if (rms > 0xFFFFU)
  {
    rms = 0xFFFFU;
  }

  return (uint16_t)rms;
}

static int32_t Lockin_GetCenteredSample(uint16_t adc_sample)
{
  return (int32_t)adc_sample - (int32_t)LOCKIN_ADC_MIDPOINT;
}

static void Lockin_FillRmsFrame(uint16_t rms_value)
{
  uint16_t i;

  NotifyCharData[0] = (uint8_t)(0x8F);
  NotifyCharData[1] = (uint8_t)(0x8E);
  NotifyCharData[2] = (uint8_t)(0x8F);

  for (i = 0U; i < ADC_CONVERTED_DATA_BUFFER_SIZE; i++)
  {
    NotifyCharData[i * 2U + 3U] = (uint8_t)(rms_value >> 8);
    NotifyCharData[i * 2U + 4U] = (uint8_t)(rms_value);
  }

  NotifyCharData[243] = (uint8_t)(0x8E);
  NotifyCharData[244] = (uint8_t)(0x8F);
  NotifyCharData[245] = (uint8_t)(0x8E);
}

static uint64_t IntSqrt64(uint64_t value)
{
  uint64_t bit = 1ULL << 62;
  uint64_t result = 0;

  while (bit > value)
  {
    bit >>= 2;
  }

  while (bit != 0U)
  {
    if (value >= result + bit)
    {
      value -= result + bit;
      result = (result >> 1) + bit;
    }
    else
    {
      result >>= 1;
    }
    bit >>= 2;
  }

  return result;
}

static void Sensor_Command_Received(const uint8_t *pPayload, uint8_t length)
{
  uint8_t status;
  uint8_t business_command;

  if ((pPayload == 0) || (length == 0U))
  {
    Sensor_SendNack(0U, 0U, 0U, SENSOR_STATUS_BAD_LENGTH);
    return;
  }

  business_command = ((length > MULTI_FRAME_TYPE_OFFSET) &&
                      (Sensor_IsBusinessCommand(pPayload[MULTI_FRAME_TYPE_OFFSET]) != 0U)) ? 1U : 0U;
  if (business_command != 0U)
  {
    Sensor_PrioritizeBusinessCommand();
  }

  status = Sensor_ParseFrame(pPayload, length);
  if (status != SENSOR_STATUS_OK)
  {
    BSP_LED_On(LED_RED);
    /* Protocol NACK must precede optional diagnostics in the BLE TX queue. */
    Sensor_SendNack(0U, 0U, 0U, status);
    if ((business_command != 0U) && (status == SENSOR_STATUS_CRC_ERROR))
    {
      Sensor_SendDiag("SENSOR_PARSE_CRC_ERROR");
    }
    else if ((business_command != 0U) && (status == SENSOR_STATUS_BAD_VERSION))
    {
      Sensor_SendDiag("SENSOR_PARSE_VERSION_ERROR");
    }
    else if (business_command != 0U)
    {
      Sensor_SendDiag("SENSOR_PARSE_LENGTH_ERROR");
    }
  }
  else if (business_command != 0U)
  {
    /* Sensor_HandleCommand has already queued the business ACK/NACK.  Keep
     * trace text behind it so diagnostics can never cause a false timeout. */
    Sensor_SendDiag("SENSOR_RX_COMMAND");
    Sensor_SendDiag("SENSOR_FRAME_VALID");
  }
}

static uint8_t Sensor_ParseFrame(const uint8_t *data, uint8_t length)
{
  uint8_t type;
  uint8_t flags;
  uint16_t node_id;
  uint16_t scan_id;
  uint16_t seq;
  uint8_t payload_len;
  uint16_t received_crc;
  uint16_t calc_crc;

  if (length < (2U + SENSOR_PROTOCOL_HEADER_LEN + 2U))
  {
    return SENSOR_STATUS_BAD_LENGTH;
  }

  if ((data[0] != SENSOR_PROTOCOL_MAGIC_0) || (data[1] != SENSOR_PROTOCOL_MAGIC_1))
  {
    return SENSOR_STATUS_BAD_LENGTH;
  }

  if (data[2] != SENSOR_PROTOCOL_VERSION)
  {
    return SENSOR_STATUS_BAD_VERSION;
  }

  type = data[3];
  flags = data[4];
  node_id = Sensor_ReadLe16(&data[MULTI_FRAME_NODE_ID_OFFSET]);
  scan_id = Sensor_ReadLe16(&data[MULTI_FRAME_SCAN_ID_OFFSET]);
  seq = Sensor_ReadLe16(&data[MULTI_FRAME_SEQ_OFFSET]);
  payload_len = data[MULTI_FRAME_PAYLOAD_LEN_OFFSET];

  if ((node_id != APP_BLE_GetNodeId()) &&
      (node_id != MULTI_PROTOCOL_NODE_BROADCAST))
  {
    return SENSOR_STATUS_BAD_LENGTH;
  }

  if ((payload_len > SENSOR_PROTOCOL_MAX_PAYLOAD) ||
      (length != (uint8_t)(2U + SENSOR_PROTOCOL_HEADER_LEN + payload_len + 2U)))
  {
    return SENSOR_STATUS_BAD_LENGTH;
  }

  received_crc = Sensor_ReadLe16(&data[MULTI_FRAME_PAYLOAD_OFFSET + payload_len]);
  calc_crc = Sensor_Crc16Ccitt(&data[MULTI_FRAME_VERSION_OFFSET],
                               (uint16_t)(SENSOR_PROTOCOL_HEADER_LEN + payload_len));
  if (received_crc != calc_crc)
  {
    return SENSOR_STATUS_CRC_ERROR;
  }

  return Sensor_HandleCommand(type, flags, scan_id, seq,
                              &data[MULTI_FRAME_PAYLOAD_OFFSET], payload_len);
}

static uint8_t Sensor_HandleCommand(uint8_t type, uint8_t flags, uint16_t scan_id, uint16_t seq, const uint8_t *payload, uint8_t payload_len)
{
  uint16_t dac_code;

