jxz1223/DC_BLE_Lockin/STM32_WPAN/App/custom_app.c
  if (((type == SENSOR_CMD_SCAN_START) ||
       (type == SENSOR_CMD_SET_DAC) ||
       (type == SENSOR_CMD_ABORT)) &&
      (Sensor_IsDuplicateCommand(type, scan_id, seq) != 0U))
  {
    if (SensorLastCommandWasAck != 0U)
    {
      Sensor_SendAck(type, scan_id, seq, SensorLastCommandStatus);
    }
    else
    {
      Sensor_SendNack(type, scan_id, seq, SensorLastCommandStatus);
    }
    return SENSOR_STATUS_OK;
  }

  switch (type)
  {
    case SENSOR_CMD_SCAN_START:
      if (payload_len < 9U)
      {
        BSP_LED_On(LED_RED);
        Sensor_SendNack(type, scan_id, seq, SENSOR_STATUS_BAD_LENGTH);
        return SENSOR_STATUS_OK;
      }
      if (SensorScan.Active != 0U)
      {
        BSP_LED_Toggle(LED_RED);
        Sensor_SendNack(type, scan_id, seq, SENSOR_STATUS_BUSY);
        return SENSOR_STATUS_OK;
      }

      SensorScan.DacMin = Sensor_ReadLe16(&payload[0]);
      SensorScan.DacMax = Sensor_ReadLe16(&payload[2]);
      SensorScan.TotalPoints = Sensor_ReadLe16(&payload[4]);
      SensorScan.SettleMs = Sensor_ReadLe16(&payload[6]);
      SensorScan.AvgBlocks = payload[8];

      if ((SensorScan.TotalPoints < 2U) || (SensorScan.TotalPoints > 255U))
      {
        BSP_LED_On(LED_RED);
        Sensor_SendNack(type, scan_id, seq, SENSOR_STATUS_BAD_LENGTH);
        return SENSOR_STATUS_OK;
      }

      if (SensorScan.SettleMs == 0U)
      {
        SensorScan.SettleMs = SENSOR_SCAN_DEFAULT_SETTLE_MS;
      }
      if (SensorScan.SettleMs > SENSOR_SCAN_MAX_SETTLE_MS)
      {
        SensorScan.SettleMs = SENSOR_SCAN_MAX_SETTLE_MS;
      }
      if (SensorScan.AvgBlocks == 0U)
      {
        SensorScan.AvgBlocks = 1U;
      }
      if (SensorScan.AvgBlocks > SENSOR_SCAN_MAX_AVG_BLOCKS)
      {
        SensorScan.AvgBlocks = SENSOR_SCAN_MAX_AVG_BLOCKS;
      }

      SensorScan.Active = 1U;
      SensorScan.BeginSent = 0U;
      SensorScan.AbortRequested = 0U;
      SensorScan.ScanId = scan_id;
      SensorScan.Seq = seq;
      SensorScan.NextPoint = 0U;
      SensorScan.CompletedPoints = 0U;
      SensorScan.PreScanDac = SensorCurrentDac;
      SensorStreamCredits = 0U;

      Sensor_SendAck(type, scan_id, seq, SENSOR_STATUS_OK);
      BSP_LED_On(LED_BLUE);
      Sensor_SendDiag("SENSOR_SCAN_ACCEPTED");
      UTIL_SEQ_SetTask(1U << CFG_TASK_DAC_SCAN_ID, CFG_SCH_PRIO_0);
      return SENSOR_STATUS_OK;

    case SENSOR_CMD_SET_DAC:
      if (payload_len < 2U)
      {
        BSP_LED_On(LED_RED);
        Sensor_SendNack(type, scan_id, seq, SENSOR_STATUS_BAD_LENGTH);
        return SENSOR_STATUS_OK;
      }
      if (SensorScan.Active != 0U)
      {
        Sensor_SendNack(type, scan_id, seq, SENSOR_STATUS_BUSY);
        return SENSOR_STATUS_OK;
      }

      dac_code = Sensor_ReadLe16(&payload[0]);
      Sensor_DacApply(dac_code);
      if (((flags & SENSOR_SET_FLAG_SAVE_DAC) != 0U) &&
          (Sensor_DacSave(dac_code) == 0U))
      {
        BSP_LED_On(LED_RED);
        Sensor_SendNack(type, scan_id, seq, SENSOR_STATUS_BUSY);
        Sensor_SendDiag("SENSOR_SET_DAC_SAVE_FAIL");
      }
      else
      {
        Sensor_SendAck(type, scan_id, seq, SENSOR_STATUS_OK);
        Sensor_SendDiag("SENSOR_SET_DAC_OK");
      }
      return SENSOR_STATUS_OK;

    case SENSOR_CMD_ABORT:
      SensorScan.AbortRequested = 1U;
      BSP_LED_Toggle(LED_RED);
      Sensor_SendAck(type, scan_id, seq, SENSOR_STATUS_OK);
      Sensor_SendDiag("SENSOR_ABORT");
      UTIL_SEQ_SetTask(1U << CFG_TASK_DAC_SCAN_ID, CFG_SCH_PRIO_0);
      return SENSOR_STATUS_OK;

    case SENSOR_CMD_STREAM_GRANT:
      if (payload_len < 1U)
      {
        return SENSOR_STATUS_BAD_LENGTH;
      }
      if (SensorScan.Active == 0U)
      {
        SensorStreamCredits = (payload[0] > SENSOR_STREAM_CREDIT_LIMIT) ?
                              SENSOR_STREAM_CREDIT_LIMIT : payload[0];
        UTIL_SEQ_SetTask(1U << CFG_TASK_DATA_TRANSFER_UPDATE_ID, CFG_SCH_PRIO_0);
      }
      return SENSOR_STATUS_OK;

    case SENSOR_CMD_FRAME_ACK:
      Sensor_HandleFrameAck(scan_id, seq, payload, payload_len);
      return SENSOR_STATUS_OK;

    default:
      BSP_LED_On(LED_RED);
      Sensor_SendNack(type, scan_id, seq, SENSOR_STATUS_UNKNOWN_TYPE);
      return SENSOR_STATUS_OK;
  }
}

static void Sensor_Scan_Task(void)
{
  uint8_t payload[1U + (SENSOR_SCAN_POINTS_PER_FRAME * 5U)];
  uint8_t count;
  uint8_t offset;
  uint16_t dac_code;
  uint16_t lockin_value;

  if ((SensorNotifyReady == 0U) || (Custom_App_Context.Tx_char_Notification_Status == 0U))
  {
    if (SensorScan.Active != 0U)
    {
      UTIL_SEQ_SetTask(1U << CFG_TASK_DAC_SCAN_ID, CFG_SCH_PRIO_0);
    }
    return;
  }

  if (SensorScan.Active == 0U)
  {
    return;
  }

  if (SensorScan.BeginSent == 0U)
  {
    uint8_t begin_payload[11];
    Sensor_WriteLe16(&begin_payload[0], SensorScan.DacMin);
    Sensor_WriteLe16(&begin_payload[2], SensorScan.DacMax);
    Sensor_WriteLe16(&begin_payload[4], SensorScan.TotalPoints);
    Sensor_WriteLe16(&begin_payload[6], SensorScan.SettleMs);
    begin_payload[8] = SensorScan.AvgBlocks;
    Sensor_WriteLe16(&begin_payload[9], SensorScan.PreScanDac);

    if (Sensor_SendFrame(SENSOR_EVT_SCAN_BEGIN,
                         MULTI_PROTOCOL_FLAG_ACK_REQUIRED,
                         SensorScan.ScanId,
                         SensorTransportSeq++,
                         begin_payload, sizeof(begin_payload)) == BLE_STATUS_SUCCESS)
    {
      SensorScan.BeginSent = 1U;
      Sensor_SendDiag("SENSOR_SCAN_EXECUTING");
      UTIL_SEQ_SetTask(1U << CFG_TASK_DAC_SCAN_ID, CFG_SCH_PRIO_0);
    }
    return;
  }

  if (SensorScan.AbortRequested != 0U)
  {
    uint8_t end_payload[5];
    Sensor_DacApply(SensorScan.PreScanDac);
    end_payload[0] = 1U;
    Sensor_WriteLe16(&end_payload[1], SensorScan.CompletedPoints);
    Sensor_WriteLe16(&end_payload[3], SensorCurrentDac);
    if (Sensor_SendFrame(SENSOR_EVT_SCAN_END,
                         MULTI_PROTOCOL_FLAG_ACK_REQUIRED,
                         SensorScan.ScanId,
                         SensorTransportSeq++,
                         end_payload, sizeof(end_payload)) == BLE_STATUS_SUCCESS)
    {
      SensorScan.Active = 0U;
      SensorScan.AbortRequested = 0U;
      Sensor_SendDiag("SENSOR_SCAN_ABORTED");
      BSP_LED_Off(LED_BLUE);
      BSP_LED_Toggle(LED_RED);
    }
    return;
  }

  if (SensorScan.NextPoint >= SensorScan.TotalPoints)
  {
    uint8_t end_payload[5];
    Sensor_DacApply(SensorScan.PreScanDac);
    end_payload[0] = 0U;
    Sensor_WriteLe16(&end_payload[1], SensorScan.CompletedPoints);
    Sensor_WriteLe16(&end_payload[3], SensorCurrentDac);
    if (Sensor_SendFrame(SENSOR_EVT_SCAN_END,
                         MULTI_PROTOCOL_FLAG_ACK_REQUIRED,
                         SensorScan.ScanId,
                         SensorTransportSeq++,
                         end_payload, sizeof(end_payload)) == BLE_STATUS_SUCCESS)
    {
      SensorScan.Active = 0U;
      Sensor_SendDiag("SENSOR_SCAN_COMPLETE");
      BSP_LED_Off(LED_BLUE);
    }
    return;
  }

  if (SensorTxCount >= (SENSOR_TX_QUEUE_DEPTH - 1U))
  {
    return;
  }

  count = 0U;
  payload[0] = 0U;
  while ((count < SENSOR_SCAN_POINTS_PER_FRAME) && (SensorScan.NextPoint < SensorScan.TotalPoints))
  {
    dac_code = Sensor_InterpolateDac(SensorScan.NextPoint);
    Sensor_DacApply(dac_code);
    HAL_Delay(SensorScan.SettleMs);
    lockin_value = Sensor_ReadLockinAverage(SensorScan.AvgBlocks);

