jxz1223/DC_BLE_Lockin/STM32_WPAN/App/custom_app.c
    offset = (uint8_t)(1U + (count * 5U));
    payload[offset] = (uint8_t)SensorScan.NextPoint;
    Sensor_WriteLe16(&payload[offset + 1U], dac_code);
    Sensor_WriteLe16(&payload[offset + 3U], lockin_value);

    SensorScan.NextPoint++;
    SensorScan.CompletedPoints++;
    count++;
  }

  payload[0] = count;
  if (Sensor_SendFrame(SENSOR_EVT_SCAN_POINTS,
                       MULTI_PROTOCOL_FLAG_ACK_REQUIRED,
                       SensorScan.ScanId,
                       SensorTransportSeq++,
                       payload,
                       (uint8_t)(1U + count * 5U)) == BLE_STATUS_INSUFFICIENT_RESOURCES)
  {
    SensorScan.NextPoint = (uint16_t)(SensorScan.NextPoint - count);
    SensorScan.CompletedPoints = (uint16_t)(SensorScan.CompletedPoints - count);
  }
  else if (SensorTxCount < (SENSOR_TX_QUEUE_DEPTH - 1U))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_DAC_SCAN_ID, CFG_SCH_PRIO_0);
  }
}

static tBleStatus Sensor_SendFrame(uint8_t type, uint8_t flags, uint16_t scan_id, uint16_t seq, const uint8_t *payload, uint8_t payload_len)
{
  uint16_t crc;
  uint16_t index = 0U;
  Sensor_TxSlot_t *pSlot;

  if ((payload_len > SENSOR_PROTOCOL_MAX_PAYLOAD) ||
      ((payload_len > 0U) && (payload == 0)))
  {
    return BLE_STATUS_INVALID_PARAMS;
  }
  if (SensorTxCount >= SENSOR_TX_QUEUE_DEPTH)
  {
    return BLE_STATUS_INSUFFICIENT_RESOURCES;
  }

  pSlot = &SensorTxQueue[SensorTxTail];
  memset(pSlot, 0, sizeof(*pSlot));
  pSlot->Data[index++] = SENSOR_PROTOCOL_MAGIC_0;
  pSlot->Data[index++] = SENSOR_PROTOCOL_MAGIC_1;
  pSlot->Data[index++] = SENSOR_PROTOCOL_VERSION;
  pSlot->Data[index++] = type;
  pSlot->Data[index++] = flags;
  Sensor_WriteLe16(&pSlot->Data[index], APP_BLE_GetNodeId());
  index = (uint16_t)(index + 2U);
  Sensor_WriteLe16(&pSlot->Data[index], scan_id);
  index = (uint16_t)(index + 2U);
  Sensor_WriteLe16(&pSlot->Data[index], seq);
  index = (uint16_t)(index + 2U);
  pSlot->Data[index++] = payload_len;

  if (payload_len > 0U)
  {
    memcpy(&pSlot->Data[index], payload, payload_len);
    index = (uint16_t)(index + payload_len);
  }

  crc = Sensor_Crc16Ccitt(&pSlot->Data[MULTI_FRAME_VERSION_OFFSET],
                          (uint16_t)(SENSOR_PROTOCOL_HEADER_LEN + payload_len));
  Sensor_WriteLe16(&pSlot->Data[index], crc);
  index = (uint16_t)(index + 2U);

  pSlot->Length = (uint8_t)index;
  pSlot->Type = type;
  pSlot->Reliable = ((flags & MULTI_PROTOCOL_FLAG_ACK_REQUIRED) != 0U) ? 1U : 0U;
  pSlot->ScanId = scan_id;
  pSlot->Seq = seq;
  SensorTxTail = (uint8_t)((SensorTxTail + 1U) % SENSOR_TX_QUEUE_DEPTH);
  SensorTxCount++;
  UTIL_SEQ_SetTask(1U << CFG_TASK_DATA_TRANSFER_UPDATE_ID, CFG_SCH_PRIO_0);
  return BLE_STATUS_SUCCESS;
}

static void Sensor_TxPump(void)
{
  Sensor_TxSlot_t *pSlot;

  if ((SensorNotifyReady == 0U) ||
      (Custom_App_Context.Tx_char_Notification_Status == 0U) ||
      (SensorTxCount == 0U))
  {
    return;
  }

  pSlot = &SensorTxQueue[SensorTxHead];
  if ((pSlot->Reliable != 0U) && (pSlot->Sent != 0U) &&
      ((HAL_GetTick() - pSlot->LastSendTick) >= SENSOR_TX_ACK_TIMEOUT_MS))
  {
    if (pSlot->Retries >= SENSOR_TX_MAX_RETRIES)
    {
      if ((pSlot->Type == SENSOR_EVT_SCAN_BEGIN) ||
          (pSlot->Type == SENSOR_EVT_SCAN_POINTS) ||
          (pSlot->Type == SENSOR_EVT_SCAN_END))
      {
        SensorScan.Active = 0U;
        BSP_LED_On(LED_RED);
      }
      Sensor_TxPop();
      if (SensorTxCount == 0U)
      {
        return;
      }
      pSlot = &SensorTxQueue[SensorTxHead];
    }
    else
    {
      pSlot->Retries++;
      pSlot->Sent = 0U;
      pSlot->Data[MULTI_FRAME_FLAGS_OFFSET] |=
        MULTI_PROTOCOL_FLAG_RETRANSMISSION;
      Sensor_RefreshQueuedFrameCrc(pSlot);
    }
  }

  if (pSlot->Sent == 0U)
  {
    tBleStatus status = Custom_STM_App_Update_Char_Variable_Length(
      CUSTOM_STM_TX_CHAR, pSlot->Data, pSlot->Length);
    if (status == BLE_STATUS_SUCCESS)
    {
      pSlot->LastSendTick = HAL_GetTick();
      if (pSlot->Reliable != 0U)
      {
        pSlot->Sent = 1U;
      }
      else
      {
        Sensor_TxPop();
        UTIL_SEQ_SetTask(1U << CFG_TASK_DATA_TRANSFER_UPDATE_ID, CFG_SCH_PRIO_0);
        if (SensorScan.Active != 0U)
        {
          UTIL_SEQ_SetTask(1U << CFG_TASK_DAC_SCAN_ID, CFG_SCH_PRIO_0);
        }
      }
    }
  }
}

static void Sensor_TxPop(void)
{
  if (SensorTxCount == 0U)
  {
    return;
  }
  memset(&SensorTxQueue[SensorTxHead], 0, sizeof(SensorTxQueue[SensorTxHead]));
  SensorTxHead = (uint8_t)((SensorTxHead + 1U) % SENSOR_TX_QUEUE_DEPTH);
  SensorTxCount--;
}

static void Sensor_PrioritizeBusinessCommand(void)
{
  /* A telemetry frame may already be waiting for its application ACK when a
   * PC command arrives.  Drop only stale leading telemetry/diagnostics so the
   * command ACK cannot sit behind several seconds of unrelated traffic. */
  SensorStreamCredits = 0U;
  while (SensorTxCount > 0U)
  {
    uint8_t type = SensorTxQueue[SensorTxHead].Type;
    if ((type != SENSOR_EVT_SENSOR_READINGS) &&
        (type != SENSOR_EVT_BLE_RAW))
    {
      break;
    }
    Sensor_TxPop();
  }
}

static void Sensor_TxReset(void)
{
  memset(SensorTxQueue, 0, sizeof(SensorTxQueue));
  SensorTxHead = 0U;
  SensorTxTail = 0U;
  SensorTxCount = 0U;
  SensorStreamCredits = 0U;
  SensorLastCommandValid = 0U;
}

static void Sensor_HandleFrameAck(uint16_t scan_id, uint16_t seq,
                                  const uint8_t *payload, uint8_t payload_len)
{
  Sensor_TxSlot_t *pSlot;

  if ((payload_len < 1U) || (SensorTxCount == 0U))
  {
    return;
  }
  pSlot = &SensorTxQueue[SensorTxHead];
  if ((pSlot->Reliable != 0U) && (pSlot->Type == payload[0]) &&
      (pSlot->ScanId == scan_id) && (pSlot->Seq == seq))
  {
    if (pSlot->Type == SENSOR_EVT_SENSOR_READINGS)
    {
      SensorStreamCredits = 0U;
    }
    Sensor_TxPop();
    UTIL_SEQ_SetTask(1U << CFG_TASK_DATA_TRANSFER_UPDATE_ID, CFG_SCH_PRIO_0);
    if (SensorScan.Active != 0U)
    {
      UTIL_SEQ_SetTask(1U << CFG_TASK_DAC_SCAN_ID, CFG_SCH_PRIO_0);
    }
  }
}

static void Sensor_RefreshQueuedFrameCrc(Sensor_TxSlot_t *pSlot)
{
  uint8_t payload_len = pSlot->Data[MULTI_FRAME_PAYLOAD_LEN_OFFSET];
  uint16_t crc = Sensor_Crc16Ccitt(
    &pSlot->Data[MULTI_FRAME_VERSION_OFFSET],
    (uint16_t)(SENSOR_PROTOCOL_HEADER_LEN + payload_len));
  Sensor_WriteLe16(&pSlot->Data[MULTI_FRAME_PAYLOAD_OFFSET + payload_len], crc);
}

