jxz1223/DC_BLE_Lockin/STM32_WPAN/App/custom_app.c
static uint8_t Sensor_HasQueuedReading(void)
{
  uint8_t count;
  uint8_t index = SensorTxHead;
  for (count = 0U; count < SensorTxCount; count++)
  {
    if (SensorTxQueue[index].Type == SENSOR_EVT_SENSOR_READINGS)
    {
      return 1U;
    }
    index = (uint8_t)((index + 1U) % SENSOR_TX_QUEUE_DEPTH);
  }
  return 0U;
}

static void Sensor_SendDiag(const char *text)
{
  uint16_t length;

  if ((text == 0) || (SensorNotifyReady == 0U) ||
      (Custom_App_Context.Tx_char_Notification_Status == 0U))
  {
    return;
  }

  length = (uint16_t)strlen(text);
  if (length > SENSOR_PROTOCOL_MAX_PAYLOAD)
  {
    length = SENSOR_PROTOCOL_MAX_PAYLOAD;
  }

  (void)Sensor_SendFrame(SENSOR_EVT_BLE_RAW,
                         0U,
                         0U,
                         SensorTransportSeq++,
                         (const uint8_t *)text,
                         (uint8_t)length);
}

static void Sensor_SendAck(uint8_t type, uint16_t scan_id, uint16_t seq, uint8_t status)
{
  uint8_t payload[2];
  Sensor_RecordCommandResult(type, scan_id, seq, status, 1U);
  payload[0] = type;
  payload[1] = status;
  (void)Sensor_SendFrame(SENSOR_EVT_ACK, 0U, scan_id, seq, payload, sizeof(payload));
}

static void Sensor_SendNack(uint8_t type, uint16_t scan_id, uint16_t seq, uint8_t status)
{
  uint8_t payload[2];
  Sensor_RecordCommandResult(type, scan_id, seq, status, 0U);
  payload[0] = type;
  payload[1] = status;
  (void)Sensor_SendFrame(SENSOR_EVT_NACK, 0U, scan_id, seq, payload, sizeof(payload));
}

static tBleStatus Sensor_SendReadingFrame(void)
{
  uint8_t payload[1U + (SENSOR_READING_ITEMS_PER_FRAME * SENSOR_READING_ITEM_SIZE)];
  uint8_t offset = 1U;
  uint16_t seq = SensorReadingSeq++;

  payload[0] = SENSOR_READING_ITEMS_PER_FRAME;
  Sensor_WriteLe16(&payload[offset], seq);
  Sensor_WriteLe16(&payload[offset + 2U], SensorCurrentDac);
  Sensor_WriteLe16(&payload[offset + 4U], lockin_rms_value);
  Sensor_WriteLe16(&payload[offset + 6U], SensorLatestAdcSample);

  return Sensor_SendFrame(SENSOR_EVT_SENSOR_READINGS,
                          MULTI_PROTOCOL_FLAG_ACK_REQUIRED,
                          0U,
                          SensorTransportSeq++,
                          payload,
                          sizeof(payload));
}

static void Sensor_RecordCommandResult(uint8_t type, uint16_t scan_id,
                                       uint16_t seq, uint8_t status,
                                       uint8_t was_ack)
{
  if ((type == SENSOR_CMD_SCAN_START) ||
      (type == SENSOR_CMD_SET_DAC) ||
      (type == SENSOR_CMD_ABORT))
  {
    SensorLastCommandValid = 1U;
    SensorLastCommandType = type;
    SensorLastCommandScanId = scan_id;
    SensorLastCommandSeq = seq;
    SensorLastCommandStatus = status;
    SensorLastCommandWasAck = was_ack;
  }
}

static uint8_t Sensor_IsDuplicateCommand(uint8_t type, uint16_t scan_id,
                                         uint16_t seq)
{
  return ((SensorLastCommandValid != 0U) &&
          (SensorLastCommandType == type) &&
          (SensorLastCommandScanId == scan_id) &&
          (SensorLastCommandSeq == seq)) ? 1U : 0U;
}

static uint8_t Sensor_IsBusinessCommand(uint8_t type)
{
  return ((type == SENSOR_CMD_SCAN_START) ||
          (type == SENSOR_CMD_SET_DAC) ||
          (type == SENSOR_CMD_ABORT)) ? 1U : 0U;
}

static uint16_t Sensor_Crc16Ccitt(const uint8_t *data, uint16_t length)
{
  uint16_t crc = 0xFFFFU;
  uint16_t i;
  uint8_t bit;

  for (i = 0U; i < length; i++)
  {
    crc ^= (uint16_t)data[i] << 8;
    for (bit = 0U; bit < 8U; bit++)
    {
      if ((crc & 0x8000U) != 0U)
      {
        crc = (uint16_t)((crc << 1) ^ 0x1021U);
      }
      else
      {
        crc = (uint16_t)(crc << 1);
      }
    }
  }

  return crc;
}

static uint16_t Sensor_ReadLe16(const uint8_t *payload)
{
  return (uint16_t)payload[0] | ((uint16_t)payload[1] << 8);
}

static void Sensor_WriteLe16(uint8_t *payload, uint16_t value)
{
  payload[0] = (uint8_t)value;
  payload[1] = (uint8_t)(value >> 8);
}

static uint16_t Sensor_InterpolateDac(uint16_t index)
{
  uint16_t denominator = (uint16_t)(SensorScan.TotalPoints - 1U);
  int32_t delta = (int32_t)SensorScan.DacMax - (int32_t)SensorScan.DacMin;
  uint32_t scaled = (uint32_t)((delta >= 0) ? delta : -delta) * index;
  scaled = (scaled + (denominator / 2U)) / denominator;

  if (delta >= 0)
  {
    return (uint16_t)(SensorScan.DacMin + scaled);
  }

  return (uint16_t)(SensorScan.DacMin - scaled);
}

static uint16_t Sensor_ReadLockinAverage(uint8_t avg_blocks)
{
  uint32_t sum = 0U;
  uint32_t last_seq;
  uint8_t i;

  if (avg_blocks == 0U)
  {
    avg_blocks = 1U;
  }

  last_seq = SensorLockinSeq;
  for (i = 0U; i < avg_blocks; i++)
  {
    sum += Sensor_WaitNextLockinValue(&last_seq);
  }

  return (uint16_t)(sum / avg_blocks);
}

static uint16_t Sensor_WaitNextLockinValue(uint32_t *pLastSeq)
{
  uint32_t start_tick;
  uint32_t last_seq;

  if (pLastSeq == 0)
  {
    return lockin_rms_value;
  }

  last_seq = *pLastSeq;
  start_tick = HAL_GetTick();
  while (SensorLockinSeq == last_seq)
  {
    if ((HAL_GetTick() - start_tick) >= SENSOR_LOCKIN_WAIT_TIMEOUT_MS)
    {
      break;
    }
  }

  *pLastSeq = SensorLockinSeq;
  return lockin_rms_value;
}

static void Sensor_DacApply(uint16_t dac_code)
{
  DAC_CHANGE(dac_code);
  SensorCurrentDac = dac_code;
}

static uint16_t Sensor_DacLoadSaved(uint16_t fallback)
{
  uint64_t raw = *((const uint64_t *)SENSOR_DAC_STORE_ADDRESS);
  uint32_t magic = (uint32_t)raw;
  uint16_t dac_code = (uint16_t)(raw >> 32);
  uint16_t dac_invert = (uint16_t)(raw >> 48);

  if ((magic == SENSOR_DAC_STORE_MAGIC) && (dac_invert == (uint16_t)~dac_code))
  {
    return dac_code;
  }

  return fallback;
}

static uint8_t Sensor_DacSave(uint16_t dac_code)
{
  FLASH_EraseInitTypeDef erase_init;
  uint32_t page_error = 0U;
  uint64_t raw;
  HAL_StatusTypeDef status;

  raw = (uint64_t)SENSOR_DAC_STORE_MAGIC |
        ((uint64_t)dac_code << 32) |
        ((uint64_t)((uint16_t)~dac_code) << 48);

  HAL_FLASH_Unlock();
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);

  erase_init.TypeErase = FLASH_TYPEERASE_PAGES;
  erase_init.Page = (SENSOR_DAC_STORE_ADDRESS - FLASH_BASE) / FLASH_PAGE_SIZE;
  erase_init.NbPages = 1U;
  status = HAL_FLASHEx_Erase(&erase_init, &page_error);
  if (status == HAL_OK)
  {
    status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, SENSOR_DAC_STORE_ADDRESS, raw);
  }

  HAL_FLASH_Lock();
  return (status == HAL_OK) ? 1U : 0U;
}

/* USER CODE END FD_LOCAL_FUNCTIONS*/
